export class FormValidator {
  constructor(config, input) {
    this._config = config;
    this._input = input;
  }

enableValidation () {
  
}




}


//Создайте класс FormValidator, который настраивает валидацию полей формы:
//принимает в конструктор объект настроек с селекторами и классами формы;
//принимает вторым параметром элемент той формы, которая валидируется;

//имеет приватные методы, которые обрабатывают форму: проверяют валидность поля, изменяют состояние кнопки сабмита, устанавливают все обработчики;

//имеет публичный метод enableValidation, который включает валидацию формы.

//Для каждой проверяемой формы создайте экземпляр класса FormValidator.